## **Merging Data**

### **Left Merge***

#### The **left merge** returns a **DataFrame**, which has all **rows of the DataFrame placed on the left side** of the merge() function. Those rows of the left DataFrame, which do **not have a corresponding matching** value in the **right DataFrame**, are then assigned **NaN** values.

In [6]:
import numpy as np
import pandas as pd

df1 = pd.DataFrame({'pointer':['A', 'B', 'C', 'B', 'A', 'D'], 
                    'value_df1':[0,1,2,3,4,5]})

df2 = pd.DataFrame({'pointer':['B', 'C', 'B', 'D', 'E'], 
                    'value_df2':[6, 7, 8, 9, 12]})

display(df1)
display(df2)

print("Left Merged DataFrame\n")

display(pd.merge(df1, df2, how = 'left')) # Performing a left merge

  pointer  value_df1
0       A          0
1       B          1
2       C          2
3       B          3
4       A          4
5       D          5

  pointer  value_df2
0       B          6
1       C          7
2       B          8
3       D          9
4       E         12

Left Merged DataFrame

  pointer  value_df1  value_df2
0       A          0        NaN
1       B          1        6.0
2       B          1        8.0
3       C          2        7.0
4       B          3        6.0
5       B          3        8.0
6       A          4        NaN
7       D          5        9.0

### **Right Merge**

#### The right merge returns a DataFrame that has all the rows of the DataFrame placed on the right side of the merge() function. The rows to the right DataFrame that do not have a corresponding matching value in the left DataFrame are assigned NaN values.

In [10]:
import numpy as np
import pandas as pd

df1 = pd.DataFrame({'pointer':['A', 'B', 'C', 'B', 'A', 'D'], 
                    'value_df1':[0,1,2,3,4,5]})

df2 = pd.DataFrame({'pointer':['B', 'Z', 'C', 'B','D','E'], 
                    'value_df2':[6,7,8,9,10,11]})

display(df1)
display(df2)


print("Right Merged DataFrame\n")
display(pd.merge(df1, df2, how = 'right')) # Performing a right merge

  pointer  value_df1
0       A          0
1       B          1
2       C          2
3       B          3
4       A          4
5       D          5

  pointer  value_df2
0       B          6
1       Z          7
2       C          8
3       B          9
4       D         10
5       E         11

Right Merged DataFrame

  pointer  value_df1  value_df2
0       B        1.0          6
1       B        3.0          6
2       Z        NaN          7
3       C        2.0          8
4       B        1.0          9
5       B        3.0          9
6       D        5.0         10
7       E        NaN         11

### **Outer Merge**

#### This function returns all the **rows of both the DataFrames given** in the merge() function. The **rows that don’t** get matched in either case are assigned **NaN** values.

In [12]:
import numpy as np
import pandas as pd

df1 = pd.DataFrame({'pointer':['A', 'B', 'C', 'B', 'A', 'D'], 
                    'value_df1':[0,1,2,3,4,5]})

df2 = pd.DataFrame({'pointer':['B', 'Z', 'C', 'B','D','E'], 
                    'value_df2':[6,7,8,9,10,11]})

display(df1)
display(df2)

print("Outer Merged DataFrame\n")
display(pd.merge(df1, df2, how = 'outer')) # Performing an outer merge

  pointer  value_df1
0       A          0
1       B          1
2       C          2
3       B          3
4       A          4
5       D          5

  pointer  value_df2
0       B          6
1       Z          7
2       C          8
3       B          9
4       D         10
5       E         11

Outer Merged DataFrame

  pointer  value_df1  value_df2
0       A        0.0        NaN
1       A        4.0        NaN
2       B        1.0        6.0
3       B        1.0        9.0
4       B        3.0        6.0
5       B        3.0        9.0
6       C        2.0        8.0
7       D        5.0       10.0
8       Z        NaN        7.0
9       E        NaN       11.0

### **Merge on multiple columns**

In [2]:
import numpy as np
import pandas as pd

df1 = pd.DataFrame({'column1':['Pak', 'USA', 'Pak', 'UK', 'Ind','None'], #Column 1
                    'column2':['A', 'B', 'C', 'B', 'A', 'D'],            #Column 2
                    'value_df1':[0,1,2,3,4,5]})

df2 = pd.DataFrame({'column1':['USA', 'UK', 'None', 'USA', 'Pak','Ind'], #Column 1
                    'column2':['B', 'Z', 'C', 'B','D','E'],              #Column 2
                    'value_df2':[6,7,8,9,10,11]})

display(df1)
display(df2)

print("Outer Merged DataFrame on Multiple Columns\n")
display(pd.merge(df1, df2, on = ['column1', 'column2'], how = 'outer'))

  column1 column2  value_df1
0     Pak       A          0
1     USA       B          1
2     Pak       C          2
3      UK       B          3
4     Ind       A          4
5    None       D          5

  column1 column2  value_df2
0     USA       B          6
1      UK       Z          7
2    None       C          8
3     USA       B          9
4     Pak       D         10
5     Ind       E         11

Outer Merged DataFrame on Multiple Columns

   column1 column2  value_df1  value_df2
0      Pak       A        0.0        NaN
1      USA       B        1.0        6.0
2      USA       B        1.0        9.0
3      Pak       C        2.0        NaN
4       UK       B        3.0        NaN
5      Ind       A        4.0        NaN
6     None       D        5.0        NaN
7       UK       Z        NaN        7.0
8     None       C        NaN        8.0
9      Pak       D        NaN       10.0
10     Ind       E        NaN       11.0

### **Merge on Index**

#### This behavior and technique is almost the same. The only difference is that now the column of one DataFrame is merged with the index of another DataFrame.

In [5]:
import numpy as np
import pandas as pd

df1 = pd.DataFrame({'pointer':['A', 'B', 'C', 'B', 'A', 'D'], 
                    'value_df1':[0,1,2,3,4,5]})

df2 = pd.DataFrame(np.arange(10,13,1), index = ['A', 'B','C'], columns = ['values'])

display(df1)
display(df2)

print("Merged on index\n")
print(pd.merge(df1, df2, left_on='pointer', right_index=True))

  pointer  value_df1
0       A          0
1       B          1
2       C          2
3       B          3
4       A          4
5       D          5

   values
A      10
B      11
C      12

Merged on index

  pointer  value_df1  values
0       A          0      10
4       A          4      10
1       B          1      11
3       B          3      11
2       C          2      12

#### The right_index=True indicates merging the chosen column on the indexes of the right DataFrame. Similarly, parameters like right_on and left_index can also be used depending on the problem.

## **Mapping Data**

#### This technique is used to map the values of a Series or a DataFrame. The current values in a **Series or a DataFrame** are made **equivalent to some other values**. Then, the pandas map function is used to either replace the mapped values or join them together. The **map()** function can also be used to fill in the **values of new columns.**

In [9]:
import pandas as pd

df = pd.DataFrame({'City':['Lahore', 'Mumbai', 'Karachi', 'London'],
                   'AQI':[147, 166, 152, 81]})

print("The Original DataFrame")
display(df)

dict_map = {'Lahore':'Pakistan', 'Karachi':'Pakistan', 'Mumbai':'India', 'London':'UK'}

df['Country'] = df['City'].map(dict_map)

print("The Mapped DataFrame")
display(df)

The Original DataFrame

      City  AQI
0   Lahore  147
1   Mumbai  166
2  Karachi  152
3   London   81

The Mapped DataFrame

      City  AQI   Country
0   Lahore  147  Pakistan
1   Mumbai  166     India
2  Karachi  152  Pakistan
3   London   81        UK

## **Removing duplicated data**

#### The **drop_duplcates()** function of pandas is used for this purpose.

In [13]:
import pandas as pd

df = pd.DataFrame({'Col1':['A', 'B', 'A', 'C', 'B', 'C'],
                    'Col2': [1, 2, 1, 3, 4, 3]})

print("The Original DataFrame")
display(df)

print("The DataFrame without duplicates")
display(df.drop_duplicates())

print("The DataFrame without Column1 duplicates")
display(df.drop_duplicates(['Col1']))

The Original DataFrame

  Col1  Col2
0    A     1
1    B     2
2    A     1
3    C     3
4    B     4
5    C     3

The DataFrame without duplicates

  Col1  Col2
0    A     1
1    B     2
3    C     3
4    B     4

The DataFrame without Column1 duplicates

  Col1  Col2
0    A     1
1    B     2
3    C     3

### **Replace Values**

#### The pandas package provides built-in functions to replace values in a Series and a DataFrame. The **replace()** function is called by both Series and DataFrame objects to execute this task.

### **Renaming Indexes**

#### The **rename()** function takes two parameters. In the index parameter, new row index names need to be defined, and in the column parameter, the **column index** names need to be defined.

In [18]:
import numpy as np
import pandas as pd

df = pd.DataFrame(abs(np.random.randn(9)).reshape(3,3), 
                          index = ['row1', 'row2', 'row3'],
                          columns = ['col1', 'col2', 'col3'])
print("The original DataFrame\n")
display(df)
print("All row and column indexes are changed")
display(df.rename(index = str.upper, columns = str.title))


print("Specific row and column indexes are changed")
display(df.rename(index = {'row3':'row_index3'}, columns = {'col3':'col_index3'}))

The original DataFrame

          col1      col2      col3
row1  0.330977  0.851438  0.296153
row2  0.391160  0.642853  1.220627
row3  0.247467  0.492449  1.552830

All row and column indexes are changed

          Col1      Col2      Col3
ROW1  0.330977  0.851438  0.296153
ROW2  0.391160  0.642853  1.220627
ROW3  0.247467  0.492449  1.552830

Specific row and column indexes are changed

                col1      col2  col_index3
row1        0.330977  0.851438    0.296153
row2        0.391160  0.642853    1.220627
row_index3  0.247467  0.492449    1.552830

## **Finding Outliers in Data**

#### Anything that lies outside the normal distribution of the provided dataset is known as an outlier.
#### Similarly, any data point that behaves differently from the rest of the set is known as an outlier.

#### **Interquartile range (IQR) method:** This method uses the **IQR** and **quantile** values to define lower and upper bounds for the data.

#### Quantile is a statistical measure that divides the data into equal parts. The main type of quantile is called quartile, which divides data into four or less equal parts.
1. The value that the first line hit is called the 1st quartile and is denoted with Q1. This point of data indicates that 25% of the data is below this point, and 75% of the data is above this point. The data point that this line hits is the middle value between the smallest value of the dataset, and the median value of the dataset.

2. The value that the second line hit is called the 2nd quartile and is denoted with Q2. This point of data indicates that 50% of the data is below this point, and 50% of the data is above this point. The data point that this line hits is the median value of the dataset.

3. The value that the third line hit is called the 3rd quartile and is denoted with Q3. This point of data indicates that 75% of the data is below this point, and 25% of the data is above this point. The data point that this line hits is the middle value between the median value of the dataset and the largest value of the dataset.

### **IQR Method**
### Interquartile range (IQR) method
1. **Sort** the **list**
2. Set the **Min** and **Max**
3. Set the Q2, Q1, Q3

4. Q2 = The **median of the whole dataset**
5. Q1 = The **median** of (Min to Q2) 
6. Q3 = The **median** of (Q2 to Max)

7. Calculate **IQR** = (Q3 - Q1)
8. Calculate the lower bound ( Q1 - (IQR * 1.5) ).
9. Calculate the upper bound ( Q3 + (IQR * 1.5) ).
10. Any value that lies below the lower bound or above the upper bound
**(Q1 - (IQR * 1.5) ) to Q3 + (IQR * 1.5) )is a potential outlier.**

In [23]:
import numpy as np
import pandas as pd

df = pd.DataFrame(np.random.randn(900,3))

display(df)

quantiles_df = (df.quantile([0.25,0.75]))

print("The 1st & 3rd quartiles of all columns:")
display(quantiles_df)




Q1 = quantiles_df[0][0.25]
Q3 = quantiles_df[0][0.75]


iqr = Q3 - Q1


lower_bound = (Q1 - (iqr * 1.5))
upper_bound = (Q3 + (iqr * 1.5))

print("The Lower bound for the first column:")
print(lower_bound, '\n')

print("The Upper bound for the first column:")
print(upper_bound, '\n')

col1 = df[0]

print("The outliers in the first column below the lower bound:")
print(col1[(col1 < lower_bound)])

print('\n', "The outliers in the first column above the upper bound:")
print(col1[(col1 > upper_bound)])

            0         1         2
0   -2.208840  1.749381  2.414909
1    0.608780  0.641186  0.468034
2   -0.907267 -1.306321 -0.128169
3   -0.209057 -1.303547  0.046629
4    0.969838  0.403598 -0.453871
..        ...       ...       ...
895  0.810080  0.698441 -0.423473
896 -1.068608 -1.491611  0.990019
897 -1.513334 -0.578653 -0.238914
898  0.942332 -1.134220 -0.039168
899 -0.890032 -0.050420  0.942105

[900 rows x 3 columns]

The 1st & 3rd quartiles of all columns:

             0         1         2
0.25 -0.644747 -0.642737 -0.652381
0.75  0.681678  0.645939  0.701186

The Lower bound for the first column:
-2.6343831940679934

The Upper bound for the first column:
2.671314209154599

The outliers in the first column below the lower bound:
510   -3.365457
811   -2.978792
Name: 0, dtype: float64

 The outliers in the first column above the upper bound:
14     2.894303
279    2.972392
785    2.738194
864    3.642236
Name: 0, dtype: float64

### **Dealing with outliers**

In [24]:
col1[(col1 < lower_bound)] = lower_bound
col1[(col1 > upper_bound)] = upper_bound

print("The outliers in the first column below the lower bound:")
print(col1[(col1 < lower_bound)])

print('\n', "The outliers in the first column above the upper bound:")
print(col1[(col1 > upper_bound)])

The outliers in the first column below the lower bound:
Series([], Name: 0, dtype: float64)

 The outliers in the first column above the upper bound:
Series([], Name: 0, dtype: float64)

## **Data Grouping**

The **.groupby()** function is used for this task. The values of the DataFrame can be grouped on both single and multiple columns.

In [28]:
import numpy as np
import pandas as pd

df = pd.DataFrame({'p1':['A','A','B','B','C','C'],'p2':['G1','G2','G1','G2','G1','G2'],
    'val_1':np.random.randn(6),'val_2':np.random.randn(6)})

display(df) 

print("DataFrame after using groupby")
print(df.groupby('p1'))

  p1  p2     val_1     val_2
0  A  G1 -0.298822  1.329265
1  A  G2  0.190437  0.733160
2  B  G1  0.297190 -1.235204
3  B  G2  0.498415  1.458486
4  C  G1 -0.731748  0.957712
5  C  G2  0.283229  0.979063

DataFrame after using groupby
<pandas.core.groupby.generic.DataFrameGroupBy object at 0x7fc34b2afc40>

#### It can be seen from the output that **instead of printing** a grouped DataFrame, a grouped by **object instance is returned** and “displayed”.

#### For a **valid-grouped** DataFrame to be returned, an **operation such as summation or averaging** needs to be **performed** on the grouped data.

In [32]:
import numpy as np
import pandas as pd

df = pd.DataFrame({'p1':['A','A','B','B','C','C'],'p2':['G1','G2','G1','G2','G1','G2'],
    'val_1':np.arange(1,7,1),'val_2':np.arange(7,13,1)})

print("The original DataFrame")
display(df)

print("DataFrame after using groupby on p1 and summing the values")
display(df.groupby('p1').sum())

print("DataFrame after using groupby on p2 and summing the values")
display(df.groupby('p2').sum())

The original DataFrame

  p1  p2  val_1  val_2
0  A  G1      1      7
1  A  G2      2      8
2  B  G1      3      9
3  B  G2      4     10
4  C  G1      5     11
5  C  G2      6     12

DataFrame after using groupby on p1 and summing the values

    val_1  val_2
p1
A       3     15
B       7     19
C      11     23

DataFrame after using groupby on p2 and summing the values

    val_1  val_2
p2
G1      9     27
G2     12     30

### **Grouping on multiple columns**

#### All the rules are the same as before, **except instead of passing one column** to the function, **a list of columns**, on which data should be grouped, is passed.

In [33]:
import numpy as np
import pandas as pd

df = pd.DataFrame({'p1':['A','A','B','B','C','C'],'p2':['G1','G2','G1','G2','G1','G2'],
    'val_1':np.arange(1,7,1),'val_2':np.arange(7,13,1)})

print("The original DataFrame")
display(df)

print("DataFrame after using groupby on p1 & p2 and Summing their values")
display(df.groupby(['p1','p2']).sum())

The original DataFrame

  p1  p2  val_1  val_2
0  A  G1      1      7
1  A  G2      2      8
2  B  G1      3      9
3  B  G2      4     10
4  C  G1      5     11
5  C  G2      6     12

DataFrame after using groupby on p1 & p2 and Summing their values

       val_1  val_2
p1 p2
A  G1      1      7
   G2      2      8
B  G1      3      9
   G2      4     10
C  G1      5     11
   G2      6     12

## **Data Aggregation**

#### The grouping and aggregating functions can sometimes seem similar, but they are actually consecutive steps in obtaining important insights about data. Data is first grouped using the ```groupby()``` function. Then, **aggregating** functions and techniques can be applied to **fetch the required information** from the data.

#### It is a process of applying operations on groups of data to extract useful insights.

In [38]:
import numpy as np
import pandas as pd
import random
# Declaring a DataFrame with values
df = pd.DataFrame({'Animal_type':[random.choice(['Chicken','Duck', 'Goat', 'Turkey']) for i in range(1,16)],
                   'legs':[random.choice(range(1,4)) for i in range(1,16)],
                   'weight':[random.choice(range(10,20)) for i in range(1,16)],
                   'height':[random.choice(range(4,15)) for i in range(1,16)],
                   'protein':abs(np.random.randn(15)),
                    })
print("The Original DataFrame:")
display(df)

Aw = df.groupby('Animal_type') # Grouping with Animal_type column

# Computing mean of individual groups
print("Average properties an animal can have:")
display(Aw.agg('mean'))

The Original DataFrame:

   Animal_type  legs  weight  height   protein
0         Goat     1      11       7  0.806481
1       Turkey     2      18      13  1.707020
2       Turkey     2      12       6  0.172367
3       Turkey     1      16      10  0.652110
4      Chicken     1      10       7  0.070495
5         Duck     3      15       7  0.849452
6         Duck     2      17       8  0.762294
7      Chicken     1      19       7  0.113010
8       Turkey     2      16      11  2.994674
9         Goat     3      13       5  0.556914
10     Chicken     2      15       8  0.985451
11        Duck     3      13       9  2.850780
12        Duck     2      17       5  0.121969
13      Turkey     2      11       5  1.094260
14      Turkey     1      16      13  0.451148

Average properties an animal can have:

                 legs     weight    height   protein
Animal_type
Chicken      1.333333  14.666667  7.333333  0.389652
Duck         2.500000  15.500000  7.250000  1.146124
Goat         2.000000  12.000000  6.000000  0.681698
Turkey       1.666667  14.833333  9.666667  1.178596